/*
 * GB1616.h
 *
 *  Created on: 2018年5月27日
 *      Author: Administrator
 */

#ifndef GB1616_H_
#define GB1616_H_
#include "main.h"
//---------------------------------------------------------------------------------
//------------------------------ ASCII字库 ---------------------------------------
//--------------------------------------------------------------------------------
typedef struct{
		unsigned char Head[1];         /* 索引 */
		unsigned char Infor[16];       /* 点阵信息 */
}_GB2312Type8x16;
//---------------------------------------------------------------------------------
//------------------------------ 中文汉字库 ---------------------------------------
//--------------------------------------------------------------------------------
typedef struct
{
		unsigned char Head[2];         /* 汉字索引 */
		unsigned char Infor[32];       /* 点阵信息 */
}_GB2312Type16x16;



extern const _GB2312Type8x16 GB2312Code8x16[];
extern const _GB2312Type16x16 GB2312Code16x16[];
extern const uint16_t len_code8x16;
extern const uint16_t len_code16x16;

#endif /* LCD_1_44_GB1616_H_ */
