/*
 * GB3232.h
 *
 *  Created on: 2019年4月30日
 *      Author: Administrator
 */

#ifndef GB2424_H_
#define GB2424_H_
#include "main.h"

//---------------------------------------------------------------------------------
//------------------------------ ASCII字库 ---------------------------------------
//--------------------------------------------------------------------------------
typedef struct{
		unsigned char Head[1];         /* 索引 */
		unsigned char Infor[48];       /* 点阵信息 */
}_GB2312Type12x24;

//---------------------------------------------------------------------------------
//------------------------------ 中文汉字库 ---------------------------------------
//--------------------------------------------------------------------------------
typedef struct
{
	unsigned char Head[2];          /* 汉字索引 */
	unsigned char Infor[72];       /* 点阵信息 */
}_GB2312Type24x24;

extern const _GB2312Type12x24 GB2312Code12x24[];
extern const _GB2312Type24x24 GB2312Code24x24[];
extern const uint16_t len_code12x24;
extern const uint16_t len_code24x24;

#endif /* GB2424_H_ */
